# Тренировка
> Условие старта: спортзал, есть 40 минут
> Ресурсы: штанга, турник, дорожка

@ Разминка
  Размяться [10 мин]
  * Чем заняться?
    - Штанга:
        Взять штангу
        -> Подходы
    - Турник:
        Повиснуть на турнике
        -> Подходы
    - (остальные):
        Побегать
        -> Подходы

@ Подходы
  ~ цикл: Повторить 3 подхода
    Сделать подход
    ? Устал?
      да:
        -> Заминка
      нет:
  ~ /цикл -> Заминка

@ Заминка
  Растянуться [5 мин]
  Сообщить тренеру результат
  -> КОНЕЦ